RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer6.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_timer6.c
 **
 ** A detailed description is available at
 ** @link Timer6Group Timer6 description @endlink
 **
 **   - 2018-11-23  CDT  First version for Device Driver Library of Timer6.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f460_timer6.h"
#include "hc32f460_utility.h"

#if (DDL_TIMER6_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup Timer6Group
 ******************************************************************************/
//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/*!< Parameter valid check for normal timer6 unit */
#define IS_VALID_NORMAL_TIMER6_UNIT(__TMR6x__)                                 \
(   (M4_TMR61 == (__TMR6x__))                   ||                             \
    (M4_TMR62 == (__TMR6x__))                   ||                             \
    (M4_TMR63 == (__TMR6x__)))

/*!< Parameter valid check for period register*/
#define IS_VALID_PERIOD_TYPE(x)                                                \
(   (Timer6PeriodA == (x))                      ||                             \
    (Timer6PeriodB == (x))                      ||                             \
    (Timer6PeriodC == (x)))
/*!< Parameter valid check for General compare register*/
#define IS_VALID_GEN_CMP_TYPE(x)                                               \
(   (Timer6GenCompareA == (x))                  ||                             \
    (Timer6GenCompareB == (x))                  ||                             \
    (Timer6GenCompareC == (x))                  ||                             \
    (Timer6GenCompareD == (x))                  ||                             \
    (Timer6GenCompareE == (x))                  ||                             \
    (Timer6GenCompareF == (x)))

/*!< Parameter valid check for Special compare register*/
#define IS_VALID_SPECIAL_CMP_TYPE(x)                                           \
(   (Timer6SpclCompA == (x))                    ||                             \
    (Timer6SpclCompB == (x))                    ||                             \
    (Timer6SpclCompC == (x))                    ||                             \
    (Timer6SpclCompD == (x))                    ||                             \
    (Timer6SpclCompE == (x))                    ||                             \
    (Timer6SpclCompF == (x)))
/*!< Parameter valid check for Count clock division */
#define IS_VALID_COUNT_CLK_DIV(x)                                              \
(   (Timer6PclkDiv1 == (x))                     ||                             \
    (Timer6PclkDiv2 == (x))                     ||                             \
    (Timer6PclkDiv4 == (x))                     ||                             \
    (Timer6PclkDiv8 == (x))                     ||                             \
    (Timer6PclkDiv16 == (x))                    ||                             \
    (Timer6PclkDiv64 == (x))                    ||                             \
    (Timer6PclkDiv256 == (x))                   ||                             \
    (Timer6PclkDiv1024 == (x)))

/*!< Parameter valid check for count mode */
#define IS_VALID_COUNT_MODE(x)                                                 \
(   (Timer6CntSawtoothMode == (x))              ||                             \
    (Timer6CntTriangularModeA == (x))           ||                             \
    (Timer6CntTriangularModeB == (x)))

/*!< Parameter valid check for count direction */
#define IS_VALID_COUNT_DIR(x)                                                  \
(   (Timer6CntDirDown == (x))                   ||                             \
    (Timer6CntDirUp == (x)))

/*!< Parameter valid check for timer6 output port */
#define IS_VALID_TIMER6_OUTPUT_PORT(x)                                         \
(   (Timer6PWMA == (x))                         ||                             \
    (Timer6PWMB == (x)))

/*!< Parameter valid check for timer6 input port */
#define IS_VALID_TIMER6_INPUT_PORT(x)                                          \
(   (Timer6PWMA == (x))                         ||                             \
    (Timer6PWMB == (x))                         ||                             \
    (Timer6TrigA == (x))                        ||                             \
    (Timer6TrigB == (x)))

/*!< Parameter valid check for start/stop count output status */
#define IS_VALID_STA_STP_OUTPUT_STATUS(x)                                      \
(   (Timer6PWMxPortOutLow == (x))               ||                             \
    (Timer6PWMxPortOutHigh == (x)))

/*!< Parameter valid check for match output status */
#define IS_VALID_MATCH_OUTPUT_STATUS(x)                                        \
(   (Timer6PWMxCompareLow == (x))        ||                                    \
    (Timer6PWMxCompareHigh == (x))       ||                                    \
    (Timer6PWMxCompareKeep == (x))       ||                                    \
    (Timer6PWMxCompareInv == (x)))

