RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer6.c
/*!< Parameter valid check for Z Phase input mask periods */
#define IS_VALID_ZPHASE_MASK_PRD(x)                                            \
(   (Timer6ZMaskDis == (x))              ||                                    \
    (Timer6ZMask4Cyl == (x))             ||                                    \
    (Timer6ZMask8Cyl == (x))             ||                                    \
    (Tiemr6ZMask16Cyl == (x)))

/*!< Parameter valid check for event source */
#define IS_VALID_EVENT_SOURCE(x)                ((x) <= 511)

/*!< Parameter validity check for common trigger. */
#define IS_VALID_TIMER6_COM_TRIGGER(x)                                         \
(   (Timer6ComTrigger_1 == (x))          ||                                    \
    (Timer6ComTrigger_2 == (x))          ||                                    \
    (Timer6ComTrigger_1_2 == (x)))

/*! TimerA registers reset value */
#define TIMERA_REG_CNTER_RESET_VALUE            (0x0000u)
#define TIMERA_REG_GCONR_RESET_VALUE            (0x00000100ul)
#define TIMERA_REG_ICONR_RESET_VALUE            (0x00000000ul)
#define TIMERA_REG_PCONR_RESET_VALUE            (0x00000000ul)
#define TIMERA_REG_BCONR_RESET_VALUE            (0x00000000ul)
#define TIMERA_REG_DCONR_RESET_VALUE            (0x00000000ul)
#define TIMERA_REG_FCONR_RESET_VALUE            (0x00000000ul)
#define TIMERA_REG_VPERR_RESET_VALUE            (0x00000000ul)


/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/*******************************************************************************
 * \brief   Timer6 interrupt request enable or disable
 *
 * \param   [in]  TMR6x            Timer6 unit
 * \param   [in]  enTimer6Irq      Irq type
 * \param   [in]  bEn              true/false
 *
 * \retval  Ok:  config successfully
 *
 ******************************************************************************/
en_result_t Timer6_ConfigIrq(M4_TMR6_TypeDef *TMR6x, en_timer6_irq_type_t enTimer6Irq, bool bEn)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_IRQ_SOURCE(enTimer6Irq));

    switch (enTimer6Irq)
    {
        case Timer6INTENA:
            TMR6x->ICONR_f.INTENA = bEn;
            break;
        case Timer6INTENB:
            TMR6x->ICONR_f.INTENB = bEn;
            break;
        case Timer6INTENC:
            TMR6x->ICONR_f.INTENC = bEn;
            break;
        case Timer6INTEND:
            TMR6x->ICONR_f.INTEND = bEn;
            break;
        case Timer6INTENE:
            TMR6x->ICONR_f.INTENE = bEn;
            break;
        case Timer6INTENF:
            TMR6x->ICONR_f.INTENF = bEn;
            break;
        case Timer6INTENOVF:
            TMR6x->ICONR_f.INTENOVF = bEn;
            break;
        case Timer6INTENUDF:
            TMR6x->ICONR_f.INTENUDF = bEn;
            break;
        case Timer6INTENDTE:
            TMR6x->ICONR_f.INTENDTE = bEn;
            break;
        case Timer6INTENSAU:
            TMR6x->ICONR_f.INTENSAU = bEn;
            break;
        case Timer6INTENSAD:
            TMR6x->ICONR_f.INTENSAD = bEn;
            break;
        case Timer6INTENSBU:
            TMR6x->ICONR_f.INTENSBU = bEn;
            break;
        case Timer6INTENSBD:
            TMR6x->ICONR_f.INTENSBD = bEn;
            break;
        default:
            break;
    }

    return Ok;
}

/**
 *******************************************************************************
 ** \brief Get Timer6 status flag
 **
 ** \param [in] TMR6x            Timer6 unit
 **
 ** \param [in] enStatus         Timer6 status type
 **
 ** \retval Timer6 status
 **
 ******************************************************************************/
uint8_t Timer6_GetStatus(M4_TMR6_TypeDef *TMR6x, en_timer6_status_t enStatus)
{
    uint8_t status = 0u;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_STATUS_TYPE(enStatus));

    switch (enStatus)
    {
        case Timer6CMAF:
            status = (uint8_t)TMR6x->STFLR_f.CMAF;
            break;
        case Timer6CMBF:
            status = (uint8_t)TMR6x->STFLR_f.CMBF;
            break;
        case Timer6CMCF:
            status = (uint8_t)TMR6x->STFLR_f.CMCF;
            break;
        case Timer6CMDF:
            status = (uint8_t)TMR6x->STFLR_f.CMDF;
            break;
        case Timer6CMEF:
            status = (uint8_t)TMR6x->STFLR_f.CMEF;
            break;
        case Timer6CMFF:
            status = (uint8_t)TMR6x->STFLR_f.CMFF;
            break;
        case Timer6OVFF:
            status = (uint8_t)TMR6x->STFLR_f.OVFF;
            break;
        case Timer6UDFF:
            status = (uint8_t)TMR6x->STFLR_f.UDFF;
            break;
        case Timer6DTEF:
            status = (uint8_t)TMR6x->STFLR_f.DTEF;
            break;
        case Timer6CMSAUF:
            status = (uint8_t)TMR6x->STFLR_f.CMSAUF;
            break;
        case Timer6CMSADF:
            status = (uint8_t)TMR6x->STFLR_f.CMSADF;
            break;
        case Timer6CMSBUF:
            status = (uint8_t)TMR6x->STFLR_f.CMSBUF;
            break;
        case Timer6CMSBDF:
            status = (uint8_t)TMR6x->STFLR_f.CMSBDF;
            break;
        case Timer6VPERNUM:
            status = (uint8_t)TMR6x->STFLR_f.VPERNUM;
            break;
        case Timer6DIRF:
            status = (uint8_t)TMR6x->STFLR_f.DIRF;
            break;
        default:
            break;
    }

