RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/src/hc32f460_timer6.c
    TMR6x->BCONR_f.BENP = pstcTimer6PrdBufCfg->bEnPeriodTransBuf;
    TMR6x->BCONR_f.BSEP = pstcTimer6PrdBufCfg->enPeriodBufTransType;

    return Ok;
}

/*******************************************************************************
 * \brief   Timer6 unit get General Compare Register Value(for PWM output)
 *
 *
 * \param   [in]  TMR6x              Timer6 unit
 * \param   [in]  enTimer6Compare    General Compare Register name
 *
 *
 * \retval  u16TempValue:  General Compare Register value
 *
 ******************************************************************************/
uint16_t Timer6_GetGeneralCmpValue(M4_TMR6_TypeDef *TMR6x, en_timer6_compare_t enTimer6Compare)
{
    uint16_t    u16TempValue = 0u;

    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_GEN_CMP_TYPE(enTimer6Compare));

    switch (enTimer6Compare)
    {
        case Timer6GenCompareA:
            u16TempValue = (uint16_t)TMR6x->GCMAR;
            break;
        case Timer6GenCompareB:
            u16TempValue = (uint16_t)TMR6x->GCMBR;
            break;
        case Timer6GenCompareC:
            u16TempValue = (uint16_t)TMR6x->GCMCR;
            break;
        case Timer6GenCompareD:
            u16TempValue = (uint16_t)TMR6x->GCMDR;
            break;
        case Timer6GenCompareE:
            u16TempValue = (uint16_t)TMR6x->GCMER;
            break;
        case Timer6GenCompareF:
            u16TempValue = (uint16_t)TMR6x->GCMFR;
            break;
        default:
            break;
    }

    return u16TempValue;
}

/***********************************************************************
 * \brief   Timer6 Config valid count period
 *
 *
 * \param   [in]  TMR6x             Timer6 unit
 * \param   [in]  pstcTimer6ValidPerCfg    Valid Count Period Pointer
 *
 * \retval  Ok:  Config successfully
 * \retval  ErrorInvalidParameter: Provided parameter is not valid
 *
 ***********************************************************************/
en_result_t Timer6_SetValidPeriod(M4_TMR6_TypeDef *TMR6x, const stc_timer6_validper_cfg_t* pstcTimer6ValidPerCfg)
{
    en_result_t enRet = Ok;

    if (NULL == pstcTimer6ValidPerCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));
        DDL_ASSERT(IS_VALID_VPERR_PCNT_EN_SOURCE(pstcTimer6ValidPerCfg->enValidCdtEn));
        DDL_ASSERT(IS_VALID_VPERR_PCNT_NUM(pstcTimer6ValidPerCfg->enValidCntNum));

        TMR6x->VPERR_f.PCNTS   = pstcTimer6ValidPerCfg->enValidCntNum;
        TMR6x->VPERR_f.PCNTE   = pstcTimer6ValidPerCfg->enValidCdtEn;
        TMR6x->VPERR_f.SPPERIA = pstcTimer6ValidPerCfg->bPeriodSCMA;
        TMR6x->VPERR_f.SPPERIB = pstcTimer6ValidPerCfg->bPeriodSCMB;
    }
    return enRet;
}

/*******************************************************************************
 * \brief   Port input config(Trig)
 *
 *
 * \param   [in]  TMR6x             Timer6 unit
 * \param   [in]  pstcTimer6PortInputCfg   Point Input Config Pointer
 *
 * \retval  Ok:  Set successfully
 * \retval  ErrorInvalidParameter: Provided parameter is not valid
 *
 ******************************************************************************/
en_result_t Timer6_PortInputConfig(M4_TMR6_TypeDef *TMR6x, const stc_timer6_port_input_cfg_t* pstcTimer6PortInputCfg)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));

    if (NULL == pstcTimer6PortInputCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        switch (pstcTimer6PortInputCfg->enPortSel)
        {
            case Timer6xCHA:
                TMR6x->PCONR_f.CAPMDA   = pstcTimer6PortInputCfg->enPortMode;
                TMR6x->FCONR_f.NOFIENGA = pstcTimer6PortInputCfg->bFltEn;
                TMR6x->FCONR_f.NOFICKGA = pstcTimer6PortInputCfg->enFltClk;
                break;

            case Timer6xCHB:
                TMR6x->PCONR_f.CAPMDB   = pstcTimer6PortInputCfg->enPortMode;
                TMR6x->FCONR_f.NOFIENGB = pstcTimer6PortInputCfg->bFltEn;
                TMR6x->FCONR_f.NOFICKGB = pstcTimer6PortInputCfg->enFltClk;
                break;

            case Timer6TrigA:
                TMR6x->FCONR_f.NOFIENTA = pstcTimer6PortInputCfg->bFltEn;
                TMR6x->FCONR_f.NOFICKTA = pstcTimer6PortInputCfg->enFltClk;
                break;

            case Timer6TrigB:
                TMR6x->FCONR_f.NOFIENTB = pstcTimer6PortInputCfg->bFltEn;
                TMR6x->FCONR_f.NOFICKTB = pstcTimer6PortInputCfg->enFltClk;
                break;

            default:
                enRet = ErrorInvalidParameter;
                break;
        }
    }
    return enRet;
}

/*******************************************************************************
 * \brief   Timer6 Output Port config
 *
 *
 * \param   [in]  TMR6x                    Timer6 unit
 * \param   [in]  enTimer6PWMPort          Timer6 Port(PWMA/PWMB)
 * \param   [in]  pstcTimer6PortOutCfg     timer6 Port Config Pointer
 *
 * \retval  Ok:  Set successfully
 * \retval  ErrorInvalidParameter: Provided parameter is not valid
 *
 ******************************************************************************/
en_result_t Timer6_PortOutputConfig(M4_TMR6_TypeDef *TMR6x,
                                en_timer6_chx_port_t enTimer6PWMPort,
                                const stc_timer6_port_output_cfg_t* pstcTimer6PortOutCfg)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_NORMAL_TIMER6_UNIT(TMR6x));
    DDL_ASSERT(IS_VALID_TIMER6_OUTPUT_PORT(enTimer6PWMPort));

    if (NULL == pstcTimer6PortOutCfg)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        switch (enTimer6PWMPort)
        {
            case Timer6PWMA:
                TMR6x->PCONR_f.CAPMDA = pstcTimer6PortOutCfg->enPortMode;
                TMR6x->PCONR_f.STACA = pstcTimer6PortOutCfg->enStaOut;
                TMR6x->PCONR_f.STPCA = pstcTimer6PortOutCfg->enStpOut;
                TMR6x->PCONR_f.STASTPSA = pstcTimer6PortOutCfg->enStaStp;
                TMR6x->PCONR_f.CMPCA = pstcTimer6PortOutCfg->enCmpc;
                TMR6x->PCONR_f.PERCA = pstcTimer6PortOutCfg->enPerc;
                TMR6x->PCONR_f.OUTENA = pstcTimer6PortOutCfg->bOutEn;
                TMR6x->PCONR_f.EMBVALA = pstcTimer6PortOutCfg->enDisVal;
                break;

